/**
 * ═══════════════════════════════════════════════════════════════════════════════
 *           范之集： 【字典】 与 【字典条目】
 * ═══════════════════════════════════════════════════════════════════════════════
 */

/** */

declare module '@wulechuan/controllers-of-enum-dictionaries' {

    export type 范_字典_唯一标识 = string;
    export type 范_字典条目_唯一标识 = string | number;

    export interface 范_字典条目之视式_最简式<范_字典条目之值 = any> {
        唯一标识: 范_字典条目_唯一标识;
        呈示称谓: string;
        值: 范_字典条目之值;
    }



    export type 范_字典诸条目之视式_其列表<
        范_字典条目之视式 extends 范_字典条目之视式_最简式 = 范_字典条目之视式_最简式<any>
    > = Array<范_字典条目之视式>;

    export type 范_字典诸条目之视式_其哈希表<
        范_字典条目之视式 extends 范_字典条目之视式_最简式 = 范_字典条目之视式_最简式<any>
    > = Record<string, 范_字典条目之视式>;



    export type 范_字典条目内容映射表_从呈示称谓至值<范_字典条目之值 = any> = Record<string, 范_字典条目之值>;
    export type 范_字典条目内容映射表_从值至呈示称谓 = { [条目之值对应之文本: string]: string; };

    export type 范_字典条目诸内容映射表之集<范_该字典_条目之值 = any> = {
        从呈示称谓至值: 范_字典条目内容映射表_从呈示称谓至值<范_该字典_条目之值>;
        从值至呈示称谓: 范_字典条目内容映射表_从值至呈示称谓;
    };



    export type 范_字典_字典特别条目_其代表全选者_形参准用式<
        范_该字典_条目视式 extends 范_字典条目之视式_最简式 = 范_字典条目之视式_最简式<any>
    > = {
        应位于候选列表之该处?: '首部' | '尾部';

        /** `呈示称谓` 字段默认取 '〔全选〕' 。 */
        字典条目之视式: Omit<范_该字典_条目视式, '呈示称谓'> & { 呈示称谓?: string; };

        当正常候选项个数为零时仍允许采用本特别项?: boolean;
    };

    export type 范_字典_字典特别条目_其代表全选者_完备式<
        范_该字典_条目视式 extends 范_字典条目之视式_最简式 = 范_字典条目之视式_最简式<any>
    > = {
        应位于候选列表之该处: '首部' | '尾部';
        字典条目之视式: 范_该字典_条目视式;
        当正常候选项个数为零时仍允许采用本特别项: boolean;
    };

    export type 范_字典_字典特别条目_其代表全都不选者_形参准用式<
        范_该字典_条目视式 extends 范_字典条目之视式_最简式 = 范_字典条目之视式_最简式<any>
    > = {
        应位于候选列表之该处?: '首部' | '尾部';

        /** `呈示称谓` 字段默认取 '〔全都不选〕' 。 */
        字典条目之视式: Omit<范_该字典_条目视式, '呈示称谓'> & { 呈示称谓?: string; };
    };

    export type 范_字典_字典特别条目_其代表全都不选者_完备式<
        范_该字典_条目视式 extends 范_字典条目之视式_最简式 = 范_字典条目之视式_最简式<any>
    > = {
        应位于候选列表之该处: '首部' | '尾部';
        字典条目之视式: 范_该字典_条目视式;
    };

}
